In [43]:
import re

In [44]:
pattern = "was"

In [45]:
search = "was a   child was"

In [46]:
print(re.findall(pattern, search))

['was', 'was']

# Match

In [47]:
print(re.match("was", search))

<re.Match object; span=(0, 3), match='was'>

# FindAll

In [48]:
print(re.findall("\s", search))

[' ', ' ', ' ', ' ', ' ']

In [49]:
print(re.findall("was", search))

['was', 'was']

In [50]:
# split string

In [51]:
print(re.split("was", search)) # split using this reges

['', ' a   child ', '']

In [52]:
print(re.split("was", search, 1)) #Split using only using the first which matches

['', ' a   child was']

# Replace all empty space with 9 each

In [53]:
txt = "The   rain in Spain"
x = re.sub("\s", "9", txt)

In [54]:
print(x)

The999rain9in9Spain

# Replace furst two instances

In [55]:
txt = "The  rain in Spain"
x = re.sub("\s", "9", txt, 2)
print(x)

The99rain in Spain

# Metacharacters

In [56]:
pattern = "[A-Z]yclone"
search = "Pyclone cyclone JDJSyclone"
print(re.findall(pattern, search))

['Pyclone', 'Syclone']

In [57]:
pattern = "[A-Z]+yclone"
search = "Pyclone cyclone JDJSyclone"
print(re.findall(pattern, search))

['Pyclone', 'JDJSyclone']

In [58]:
pattern = "[A-Z]*yclone"
search = "Pyclone cyclone JDJSyclone"
print(re.findall(pattern, search))

['Pyclone', 'yclone', 'JDJSyclone']

In [59]:
pattern = "[A-Z]{2}yclone"
search = "Pyclone cyclone JDJSyclone"
print(re.findall(pattern, search))

['JSyclone']

In [60]:
pattern = r"[A-Z]{2}yclone|[a-z]+yclone"
search = "Pyclone fcyclone JDJSyclone"
print(re.findall(pattern, search))

['fcyclone', 'JSyclone']

In [61]:
pattern = "[ylco]+"
search = "Pyclone fcyclone JDJSyclone"
print(re.findall(pattern, search))

['yclo', 'cyclo', 'yclo']

In [62]:
pattern = "[^ylco]+"
search = "Pyclone fcyclone JDJSyclone"
print(re.findall(pattern, search))

['P', 'ne f', 'ne JDJS', 'ne']

In [63]:
pattern = "\w+"
search = "Pyclone fcyclone JDJS21yclone"
print(re.findall(pattern, search))

['Pyclone', 'fcyclone', 'JDJS21yclone']

In [64]:
pattern = "\d+"
search = "Pyclone fcyclone JDJS21yclone"
print(re.findall(pattern, search))

['21']

In [65]:
pattern = "\s"
search = "Pyclone fcyclone JDJS21yclone"
print(re.findall(pattern, search))

[' ', ' ']

In [66]:
pattern = "\d{2}"
search = "Pyclone fcyclone JDJS2341yclone"
print(re.findall(pattern, search))

['23', '41']

In [67]:
pattern = "[\d]{3}"
search = "Pyclone fcyclone JDJS2341yclone"
print(re.findall(pattern, search))

['234']

# SLICING

In [68]:
b = "Hello, World!"
print(b[2:5]) # 2, 3 and 4

llo

In [69]:
import numpy as np

arr = np.array([1, 2, 3, 4, 5, 6, 7])

print(arr[-3:-1])

[5 6]

In [70]:
import numpy as np

arr = np.array([1, 2, 3, 4, 5, 6, 7])

print(arr[:4])

[1 2 3 4]

In [71]:
arr = np.array([1, 2, 3, 4, 5, 6, 7])

print(arr[1:5:2])

[2 4]

In [72]:
arr = np.array([1, 2, 3, 4, 5, 6, 7])

print(arr[1::2])

[2 4 6]

# Dictonaries

###### 3.7 onwards, dictoniares are oreded

In [73]:
thisdict = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}
print(thisdict)

{'brand': 'Ford', 'model': 'Mustang', 'year': 1964}

In [74]:
thisdict = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}
print(thisdict["brand"])

Ford

In [75]:
print(len(thisdict))

3

In [76]:
print(type(thisdict))

<class 'dict'>

In [77]:
a = thisdict.keys()
print(a)

dict_keys(['brand', 'model', 'year'])

In [78]:
values = thisdict.values()
print(values)

dict_values(['Ford', 'Mustang', 1964])

In [79]:
print(thisdict.items())

dict_items([('brand', 'Ford'), ('model', 'Mustang'), ('year', 1964)])

In [80]:
thisdict = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}
if "model" in thisdict.keys():
  print("Yes, 'model' is one of the keys in the thisdict dictionary")

Yes, 'model' is one of the keys in the thisdict dictionary

In [81]:
thisdict = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}
thisdict.update({"year": 2020})

print(thisdict)

{'brand': 'Ford', 'model': 'Mustang', 'year': 2020}

In [82]:
thisdict = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}
thisdict["color"] = "red"
print(thisdict)          # add a color key and value

{'brand': 'Ford', 'model': 'Mustang', 'year': 1964, 'color': 'red'}

In [83]:
thisdict = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}
thisdict.clear()
print(thisdict)

{}

In [84]:
thisdict = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}
del thisdict
print(thisdict)

NameError: name 'thisdict' is not defined

In [85]:
thisdict = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}


for x in thisdict:
  print(x)

for x in thisdict:
  print(thisdict[x])

brand
model
year
Ford
Mustang
1964

In [86]:
for x, y in thisdict.items():
  print(x, y)

brand Ford
model Mustang
year 1964

In [87]:
thisdict = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}
mydict = thisdict.copy()   # however both of them will point to same dictionary, so changes made in one dict will affect the other as well
print(mydict)

{'brand': 'Ford', 'model': 'Mustang', 'year': 1964}

In [88]:
myfamily = {
  "child1" : {
    "name" : "Emil",
    "year" : 2004
  },
  "child2" : {
    "name" : "Tobias",
    "year" : 2007
  },
  "child3" : {
    "name" : "Linus",
    "year" : 2011
  }
}

print(myfamily["child2"]["name"])

Tobias

In [89]:
myfamily = {
  "child1" : {
    "name" : "Emil",
    "year" : 2004
  },
  "child2" : {
    "name" : "Tobias",
    "year" : 2007
  },
  "child3" : {
    "name" : "Linus",
    "year" : 2011
  }
}

for x, obj in myfamily.items():
    print(x)
    
    for y in obj:
        print(y + ':', obj[y])

child1
name: Emil
year: 2004
child2
name: Tobias
year: 2007
child3
name: Linus
year: 2011

# Sets

In [90]:
thisset = {"apple", "banana", "cherry"}

print(len(thisset))

3

In [91]:
thisset = {"apple", "banana", False}

print(thisset)
print(type(thisset))

{False, 'apple', 'banana'}
<class 'set'>

In [92]:
thisset = {"apple", "banana", "cherry"}

for x in thisset:
  print(x)

print("banana" in thisset)

cherry
apple
banana
True

In [93]:
thisset = {"apple", "banana", "cherry"}

thisset.add("orange")

print(thisset)

{'cherry', 'apple', 'banana', 'orange'}

In [94]:
thisset = {"apple", "banana", "cherry"}
tropical = {"pineapple", "mango", "papaya"}

thisset.update(tropical)

print(thisset)

{'cherry', 'papaya', 'mango', 'apple', 'banana', 'pineapple'}

In [95]:
thisset = {"apple", "banana", "cherry"}
mylist = ["kiwi", "orange"]

thisset.update(mylist)

print(thisset)

{'cherry', 'banana', 'kiwi', 'orange', 'apple'}

In [96]:
thisset = {"apple", "banana", "cherry"}

thisset.discard("banana")   # Without throwing exception

print(thisset)

{'cherry', 'apple'}

In [97]:
thisset = {"apple", "banana", "cherry"}

thisset.clear()

print(thisset)

set()

In [98]:
set1 = {"a", "b", "c"}
set2 = {1, 2, 3}
set3 = {"John", "Elena", "a", "b", "c"}
set4 = {"apple", "bananas", "cherry"}

myset = set1.union(set2, set3, set4)
print(myset)

{1, 2, 3, 'cherry', 'a', 'apple', 'John', 'bananas', 'Elena', 'c', 'b'}

# Pandas

In [99]:
import pandas as pd
import numpy as np

In [100]:
dict1 = {"name": "newtan",
        "surname": "mukherjee",
        "marks": [1,2,3,4]}

In [101]:
df = pd.DataFrame(dict1)

In [102]:
df

     name    surname  marks
0  newtan  mukherjee      1
1  newtan  mukherjee      2
2  newtan  mukherjee      3
3  newtan  mukherjee      4

In [103]:
df.to_csv('newtan.csv')

In [104]:
df.to_csv('newtan.csv', index = False)

In [105]:
df.head(3)

     name    surname  marks
0  newtan  mukherjee      1
1  newtan  mukherjee      2
2  newtan  mukherjee      3

In [106]:
df.tail(2)

     name    surname  marks
2  newtan  mukherjee      3
3  newtan  mukherjee      4

In [107]:
df.describe()  # Numerical columns statistical analysis

          marks
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [108]:
df2 = pd.read_csv('newtan.csv')

In [109]:
df2.head()

     name    surname  marks
0  newtan  mukherjee      1
1  newtan  mukherjee      2
2  newtan  mukherjee      3
3  newtan  mukherjee      4

In [110]:
df['name'][1] = 'harsh'   # cgange values correponding to an index at a slice

C:\Users\my\AppData\Local\Temp\ipykernel_17924\481601147.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'][1] = 'harsh'   # cgange values correponding to an index at a slice

In [111]:
df.head()

     name    surname  marks
0  newtan  mukherjee      1
1   harsh  mukherjee      2
2  newtan  mukherjee      3
3  newtan  mukherjee      4

In [112]:
df.index = ['first', 'second', 'third', 'fourth']

In [113]:
df.head()

          name    surname  marks
first   newtan  mukherjee      1
second   harsh  mukherjee      2
third   newtan  mukherjee      3
fourth  newtan  mukherjee      4

In [114]:
ser = pd.Series(np.random.rand(5))

In [115]:
ser

0    0.419632
1    0.989871
2    0.854071
3    0.319279
4    0.769079
dtype: float64

In [116]:
print(type(ser))

<class 'pandas.core.series.Series'>

In [117]:
dataFrame =  pd.DataFrame(np.random.rand(5))

In [118]:
dataFrame.head()

          0
0  0.524386
1  0.166387
2  0.780932
3  0.681365
4  0.595382

In [119]:
print(type(dataFrame))

<class 'pandas.core.frame.DataFrame'>

In [120]:
dataFrame =  pd.DataFrame(np.random.rand(5,7))

In [121]:
print(dataFrame)

          0         1         2         3         4         5         6
0  0.326856  0.084446  0.608523  0.172650  0.665257  0.886400  0.579239
1  0.478510  0.990280  0.391509  0.204213  0.779200  0.670630  0.993223
2  0.476481  0.503598  0.667815  0.266115  0.829073  0.255410  0.596635
3  0.050383  0.807997  0.342456  0.837508  0.717598  0.921567  0.702254
4  0.205352  0.972982  0.311395  0.115636  0.381257  0.948770  0.380561

In [122]:
dataFrame.describe()

              0         1         2         3         4         5         6
count  5.000000  5.000000  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.307516  0.671861  0.464339  0.319225  0.674477  0.736555  0.650382
std    0.183519  0.382089  0.162591  0.294788  0.175206  0.290502  0.224156
min    0.050383  0.084446  0.311395  0.115636  0.381257  0.255410  0.380561
25%    0.205352  0.503598  0.342456  0.172650  0.665257  0.670630  0.579239
50%    0.326856  0.807997  0.391509  0.204213  0.717598  0.886400  0.596635
75%    0.476481  0.972982  0.608523  0.266115  0.779200  0.921567  0.702254
max    0.478510  0.990280  0.667815  0.837508  0.829073  0.948770  0.993223

In [123]:
dataFrame.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
5    float64
6    float64
dtype: object

In [124]:
dataFrame[0][0] = 'harry'

C:\Users\my\AppData\Local\Temp\ipykernel_17924\1538482231.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'harry' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  dataFrame[0][0] = 'harry'

In [125]:
dataFrame.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
5    float64
6    float64
dtype: object

In [126]:
dataFrame.index

RangeIndex(start=0, stop=5, step=1)

In [127]:
dataFrame.to_numpy()

array([['harry', 0.08444568269975694, 0.6085228131362512,
        0.17264990040080608, 0.6652573526284863, 0.8863998718381001,
        0.5792392043567813],
       [0.4785104837392683, 0.9902803906550616, 0.39150882026758826,
        0.20421252289312497, 0.7791999296247594, 0.6706295030707298,
        0.9932228833923346],
       [0.476481411417327, 0.5035982591832826, 0.6678150040699432,
        0.2661151522309626, 0.8290731044158557, 0.2554101412839117,
        0.596634895871857],
       [0.05038283341418259, 0.8079965132792987, 0.34245569832293143,
        0.8375084513107337, 0.7175977881359038, 0.9215674169923793,
        0.7022538388313249],
       [0.20535170908763944, 0.9729823061412566, 0.311394959054057,
        0.11563647316984871, 0.38125736825910306, 0.9487699142020414,
        0.3805607405407335]], dtype=object)

In [128]:
dataFrame.T

          0         1         2         3         4
0     harry   0.47851  0.476481  0.050383  0.205352
1  0.084446   0.99028  0.503598  0.807997  0.972982
2  0.608523  0.391509  0.667815  0.342456  0.311395
3   0.17265  0.204213  0.266115  0.837508  0.115636
4  0.665257    0.7792  0.829073  0.717598  0.381257
5    0.8864   0.67063   0.25541  0.921567   0.94877
6  0.579239  0.993223  0.596635  0.702254  0.380561

In [129]:
dataFrame.sort_index(axis=0, ascending = False)

          0         1         2         3         4         5         6
4  0.205352  0.972982  0.311395  0.115636  0.381257  0.948770  0.380561
3  0.050383  0.807997  0.342456  0.837508  0.717598  0.921567  0.702254
2  0.476481  0.503598  0.667815  0.266115  0.829073  0.255410  0.596635
1   0.47851  0.990280  0.391509  0.204213  0.779200  0.670630  0.993223
0     harry  0.084446  0.608523  0.172650  0.665257  0.886400  0.579239

In [130]:
dataFrame.sort_index(axis=1, ascending = False)

          6         5         4         3         2         1         0
0  0.579239  0.886400  0.665257  0.172650  0.608523  0.084446     harry
1  0.993223  0.670630  0.779200  0.204213  0.391509  0.990280   0.47851
2  0.596635  0.255410  0.829073  0.266115  0.667815  0.503598  0.476481
3  0.702254  0.921567  0.717598  0.837508  0.342456  0.807997  0.050383
4  0.380561  0.948770  0.381257  0.115636  0.311395  0.972982  0.205352

In [131]:
type(dataFrame[0])

pandas.core.series.Series

In [132]:
newdf2 = dataFrame.copy()

In [133]:
newdf2

          0         1         2         3         4         5         6
0     harry  0.084446  0.608523  0.172650  0.665257  0.886400  0.579239
1   0.47851  0.990280  0.391509  0.204213  0.779200  0.670630  0.993223
2  0.476481  0.503598  0.667815  0.266115  0.829073  0.255410  0.596635
3  0.050383  0.807997  0.342456  0.837508  0.717598  0.921567  0.702254
4  0.205352  0.972982  0.311395  0.115636  0.381257  0.948770  0.380561

In [134]:
newdf2.columns = list("ABCDEFG")

In [136]:
newdf2

          A         B         C         D         E         F         G
0     harry  0.084446  0.608523  0.172650  0.665257  0.886400  0.579239
1   0.47851  0.990280  0.391509  0.204213  0.779200  0.670630  0.993223
2  0.476481  0.503598  0.667815  0.266115  0.829073  0.255410  0.596635
3  0.050383  0.807997  0.342456  0.837508  0.717598  0.921567  0.702254
4  0.205352  0.972982  0.311395  0.115636  0.381257  0.948770  0.380561

In [137]:
newdf2.loc[3,'C'] = "3C"

C:\Users\my\AppData\Local\Temp\ipykernel_17924\1087135841.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '3C' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf2.loc[3,'C'] = "3C"

In [146]:
newdf2

          A         B         C         D         E         F         G
0     harry  0.084446  0.608523  0.172650  0.665257  0.886400  0.579239
1   0.47851  0.990280  0.391509  0.204213  0.779200  0.670630  0.993223
2  0.476481  0.503598  0.667815  0.266115  0.829073  0.255410  0.596635
3  0.050383  0.807997        3C  0.837508  0.717598  0.921567  0.702254
4  0.205352  0.972982  0.311395  0.115636  0.381257  0.948770  0.380561

In [147]:
newdf2.loc[[1,3],['A', 'C']] = "3C"

In [148]:
newdf2

          A         B         C         D         E         F         G
0     harry  0.084446  0.608523  0.172650  0.665257  0.886400  0.579239
1        3C  0.990280        3C  0.204213  0.779200  0.670630  0.993223
2  0.476481  0.503598  0.667815  0.266115  0.829073  0.255410  0.596635
3        3C  0.807997        3C  0.837508  0.717598  0.921567  0.702254
4  0.205352  0.972982  0.311395  0.115636  0.381257  0.948770  0.380561

In [149]:
newdf2.drop("C", axis=1) # Drop this column

          A         B         D         E         F         G
0     harry  0.084446  0.172650  0.665257  0.886400  0.579239
1        3C  0.990280  0.204213  0.779200  0.670630  0.993223
2  0.476481  0.503598  0.266115  0.829073  0.255410  0.596635
3        3C  0.807997  0.837508  0.717598  0.921567  0.702254
4  0.205352  0.972982  0.115636  0.381257  0.948770  0.380561

In [151]:
newdf2.loc[[1,2], :]

          A         B         C         D         E        F         G
1        3C  0.990280        3C  0.204213  0.779200  0.67063  0.993223
2  0.476481  0.503598  0.667815  0.266115  0.829073  0.25541  0.596635

In [156]:
newdf2.loc[newdf2['B']>0.6]

          A         B         C         D         E         F         G
1        3C  0.990280        3C  0.204213  0.779200  0.670630  0.993223
3        3C  0.807997        3C  0.837508  0.717598  0.921567  0.702254
4  0.205352  0.972982  0.311395  0.115636  0.381257  0.948770  0.380561